.. _tfn_userguide:

Australian Tax File Numbers
===========================

Introduction
------------

The function :func:`clean_au_tfn() <dataprep.clean.clean_au_tfn.clean_au_tfn>` cleans a column containing Australian Tax File Numbers (TFN) strings, and standardizes them in a given format. The function :func:`validate_au_tfn() <dataprep.clean.clean_au_tfn.validate_au_tfn>` validates either a single TFN strings, a column of TFN strings or a DataFrame of TFN strings, returning `True` if the value is valid, and `False` otherwise.

TFN strings can be converted to the following formats via the `output_format` parameter:

* `compact`: only number strings without any seperators or whitespace, like "123456782"
* `standard`: TFN strings with proper whitespace in the proper places, like "123 456 782"

Invalid parsing is handled with the `errors` parameter:

* `coerce` (default): invalid parsing will be set to NaN
* `ignore`: invalid parsing will return the input
* `raise`: invalid parsing will raise an exception

The following sections demonstrate the functionality of `clean_au_tfn()` and `validate_au_tfn()`.

### An example dataset containing TFN strings

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame(
    {
        "tfn": [
            "123 456 782",
            "999 999 999",
            "123456782",
            "51 824 753 556",
            "hello",
            np.nan,
            "NULL"
        ], 
        "address": [
            "123 Pine Ave.",
            "main st",
            "1234 west main heights 57033",
            "apt 1 789 s maple rd manhattan",
            "robie house, 789 north main street",
            "(staples center) 1111 S Figueroa St, Los Angeles",
            "hello",
        ]
    }
)
df

              tfn                                           address
0     123 456 782                                     123 Pine Ave.
1     999 999 999                                           main st
2       123456782                      1234 west main heights 57033
3  51 824 753 556                    apt 1 789 s maple rd manhattan
4           hello                robie house, 789 north main street
5             NaN  (staples center) 1111 S Figueroa St, Los Angeles
6            NULL                                             hello

## 1. Default `clean_au_tfn`

By default, `clean_au_tfn` will clean tfn strings and output them in the standard format with proper separators.

In [2]:
from dataprep.clean import clean_au_tfn
clean_au_tfn(df, column = "tfn")

,tfn,address,tfn_clean
0,123 456 782,123 Pine Ave.,123 456 782
1,999 999 999,main st,NaN
2,123456782,1234 west main heights 57033,123 456 782
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 2. Output formats

This section demonstrates the output parameter.

### `standard` (default)

In [3]:
clean_au_tfn(df, column = "tfn", output_format="standard")

,tfn,address,tfn_clean
0,123 456 782,123 Pine Ave.,123 456 782
1,999 999 999,main st,NaN
2,123456782,1234 west main heights 57033,123 456 782
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

### `compact`

In [4]:
clean_au_tfn(df, column = "tfn", output_format="compact")

              tfn                                           address  tfn_clean
0     123 456 782                                     123 Pine Ave.  123456782
1     999 999 999                                           main st        NaN
2       123456782                      1234 west main heights 57033  123456782
3  51 824 753 556                    apt 1 789 s maple rd manhattan        NaN
4           hello                robie house, 789 north main street        NaN
5             NaN  (staples center) 1111 S Figueroa St, Los Angeles        NaN
6            NULL                                             hello        NaN

## 3. `inplace` parameter

This deletes the given column from the returned DataFrame. 
A new column containing cleaned TFN strings is added with a title in the format `"{original title}_clean"`.

In [5]:
clean_au_tfn(df, column="tfn", inplace=True)

     tfn_clean                                           address
0  123 456 782                                     123 Pine Ave.
1          NaN                                           main st
2  123 456 782                      1234 west main heights 57033
3          NaN                    apt 1 789 s maple rd manhattan
4          NaN                robie house, 789 north main street
5          NaN  (staples center) 1111 S Figueroa St, Los Angeles
6          NaN                                             hello

## 4. `errors` parameter

### `coerce` (default)

In [6]:
clean_au_tfn(df, "tfn", errors="coerce")

,tfn,address,tfn_clean
0,123 456 782,123 Pine Ave.,123 456 782
1,999 999 999,main st,NaN
2,123456782,1234 west main heights 57033,123 456 782
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

### `ignore`

In [7]:
clean_au_tfn(df, "tfn", errors="ignore")

,tfn,address,tfn_clean
0,123 456 782,123 Pine Ave.,123 456 782
1,999 999 999,main st,999 999 999
2,123456782,1234 west main heights 57033,123 456 782
3,51 824 753 556,apt 1 789 s maple rd manhattan,51 824 753 556
4,hello,"robie house, 789 north main street",hello
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 4. `validate_au_tfn()`

`validate_au_tfn()` returns `True` when the input is a valid TFN. Otherwise it returns `False`.

The input of `validate_au_tfn()` can be a string, a Pandas DataSeries, a Dask DataSeries, a Pandas DataFrame and a dask DataFrame.

When the input is a string, a Pandas DataSeries or a Dask DataSeries, user doesn't need to specify a column name to be validated. 

When the input is a Pandas DataFrame or a dask DataFrame, user can both specify or not specify a column name to be validated. If user specify the column name, `validate_au_tfn()` only returns the validation result for the specified column. If user doesn't specify the column name, `validate_au_tfn()` returns the validation result for the whole DataFrame.

In [8]:
from dataprep.clean import validate_au_tfn
print(validate_au_tfn("123 456 782"))
print(validate_au_tfn("99 999 999"))
print(validate_au_tfn("123456782"))
print(validate_au_tfn("51 824 753 556"))
print(validate_au_tfn("hello"))
print(validate_au_tfn(np.nan))
print(validate_au_tfn("NULL"))

True
False
True
False
False
False
False

### Series

In [9]:
validate_au_tfn(df["tfn"])

0     True
1    False
2     True
3    False
4    False
5    False
6    False
Name: tfn, dtype: bool

### DataFrame + Specify Column

In [10]:
validate_au_tfn(df, column="tfn")

0     True
1    False
2     True
3    False
4    False
5    False
6    False
Name: tfn, dtype: bool

### Only DataFrame

In [11]:
validate_au_tfn(df)

     tfn  address
0   True    False
1  False    False
2   True    False
3  False    False
4  False    False
5  False    False
6  False    False